Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་ཆོས་མུ་མེད་པ་དག་ཀུན་རྫོབ་དང་། དོན་དམ་པར་ཀུན་ནས་མཐོང་ཞིང་རྒྱས་པར་བྱེད། རེག་པར་བྱེད། རྣམ་པར་འགོད་ཅིང་སྟོན་ཏེ།
en: Noble son, similarly, the wind-like bodhisattvas perceive, expand on, reach, set forth, and teach all the infinite phenomena in terms of the relative and ultimate.

source: དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དག་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་དག་ཏུ་
en: Within the circles that surround buddhas and bodhisattvas, as well as within all the realms of wandering beings,

source: ཡིད་ཀྱི་མགྱོགས་པ་དང་ལྡན་ཞིང་། ཕྱོགས་ཐམས་ཅད་ཀྱི་མཐར་ཐུག་པའི་སྤྱོད་ཡུལ་པར་གྱུར་ནས་རྒྱུ་ཞིང་འགྲོ་སྟེ།
en: move and shift with the swiftness of mind, remaining involved in activities as far as space extends.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་ཡུལ་ཀུན་ཏུ་མུ་མེད་པ་ཡིན་ནོ།
en: In this way, noble son, bodhisattvas are involved in endless activities.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ང་རྒྱལ་གྱིས་སྙེམས་པའི་རྩེ་མོ་འཐོར་ཞིང་འཇིག་ལ་རབ་ཏུ་རྙིལ་པར་བྱེད་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas scatter, crush, and destroy the mountain peaks of sentient beings’ arrogant pride.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་རི་དང་། ཁྱིམ་དང་། ནགས་ཚལ་གྱི་རྩེ་མོ་དག་འདུད་པར་བྱེད། རབ་ཏུ་རྙིལ་བར་བྱེད། རྣམ་པར་འཇིག་པར་བྱེད། འཐོར་བར་བྱེད། མི་སྔར་བར་བྱེད་དོ།
en: Consider, noble son, how the wind brings down mountain peaks, roofs, and treetops, destroying them, crushing them, scattering them, and making them disappear.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་སེམས་ཅན་ང་རྒྱལ་དང་། རློམ་པ་དང་། དྲེགས་པ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བའི་རྩེ་མོས་སྙེམས་པ་རྣམས་
en: Similarly, the wind-like bodhisattvas strike sentient beings who are elevated on peaks of pride, conceit, arrogance, and the view of the transitory collection.

source: གཟུགས་དང་། དར་ལ་བབ་པ་དང་། ལོངས་སྤྱོད་དང་། དབང་དང་། སྟོབས་དང་། ཚེ་དང་། ནད་མེད་པ་དང་། འཚོ་བ་དང་། བཟོ་དང་། ཐོས་པ་དང་། ཡིད་གཞུངས་པ་དང་། གཡོག་དང་། སྨྲ་མཁས་པ་དང་། དཔལ་ཆེ་བའི་དྲེགས་པས་མྱོས་པ་དག་
en: They strike beings who are intoxicated by arrogance based on their physique, youth, possessions, influence, power, lifespan, health, livelihood, skills, learning, intelligence, servants, eloquence, or splendor.

source: ཡང་དག་པའི་ནན་ཏན་གྱིས་བདག་བསྟོད་པ་རྣམས་ལ་དེ་དང་ཁྱད་ཞུགས་པའི་ཕུན་སུམ་ཚོགས་པ་བསྟན་པ་དང་།
en: Thus, to those who continuously praise themselves they show something that is still more excellent.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་
en: Consider, noble son, how the wind

source: ཆོས་བསྟན་པས་ང་རྒྱལ་ཆོམས་པར་བྱེད་ཅིང་དགེ་བ་དྲི་མ་མེད་པ་ལ་སྦྱོར་བར་བྱེད་དེ།
en: As the bodhisattvas teach them the Dharma they make them conquer their pride and practice stainless virtue.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ང་རྒྱལ་ཀྱིས་སྙེམས་པའི་རྩེ་མོ་འཐོར་ཞིང་འཇིག་ལ་རབ་ཏུ་རྙིལ་བར་བྱེད་པ་ཡིན་ནོ།
en: In this way, noble son, bodhisattvas scatter, crush, and destroy the mountain peaks of arrogance in sentient beings.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཆར་སྤྲིན་ཆེན་པོ་ཀུན་ནས་སྐྱེད་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas amass great rainclouds of Dharma.

source: འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱ་དག་ཀུན་ནས་ཡོངས་སུ་ཁེབས་པར་བྱས་ཏེ།
en: moves in quadrillions of worlds

source: སྤྲིན་གྱི་དཀྱིལ་འཁོར་ཁ་དོག་སྣ་ཚོགས་ཅན་དང་། ཟབ་ཅིང་གསལ་ལ་མཉེན་ཞིང་འཇམ་པའི་འབྲུག་སྒྲ་རྒྱ་མཚོའི་དབྱངས་ཅན། ཀླུང་རོ་སྣ་ཚོགས་ཀྱི་སྒྲ་འབྱིན་ཅིང་ཡིད་དུ་འོང་བའི་དབྱངས་རྗེས་སུ་གྲག་པ། གློག་གི་ཕྲེང་བའི་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན་པ་
en: amassing various cloudbanks—clouds of various colors; clouds that are deep and bright; clouds that resound with the ocean-like sounds of gentle thunder; clouds that emit song, music, and delightful tunes; and clouds that are adorned with garlands of lightning.

source: ཆར་གྱི་རྒྱུན་ཆེན་པོ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་མངོན་པར་འབེབས་པའི་སྤྲིན་ཆེན་པོ་ཀུན་ནས་སློང་ངོ་།
en: In this way the wind amasses great cloud formations that yield a constant and continuous downpour of rain,

source: འགྲོ་བ་ཐམས་ཅད་དགའ་བ་དང་། ལོ་ཏོག་དང་། སྡོང་པོ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་
en: thereby bringing happiness to sentient beings and the growth of crops and trees.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་ལུས་སྣ་ཚོགས་ཀྱི་སྤྲིན་སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པ།
en: Likewise, the wind-like bodhisattvas delight sentient beings with their cloudbanks of numerous bodies.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བར་བྱེད་པ། འོད་ཟེར་ཁ་དོག་མཐའ་ཡས་པའི་གློག་གི་ཕྲེང་བའི་རྒྱུན་འབྱུང་བ།
en: They illumine the infinite and endless world realms of the ten directions with continuous garlands of lightning that flash in boundless colors.

source: ཡང་དག་པ་དེ་ཁོ་ན་ཉིད་ཀྱི་ཆོས་ཀྱི་འབྲུག་སྒྲ་ཡན་ལག་སྟོང་ཕྲག་དྲུག་ཅུ་པ་སྒྲོགས་པ།
en: In sixty thousand ways they roar with the thunder of the Dharma of true reality.

source: སྙིང་རྗེ་ཆེན་པོའི་རླུང་མར་གྱིས་ཡང་དག་པར་མཐོ་བ།
en: With the wind of compassion, they are truly exalted.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པའི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ནམ་མཁའ་ཁྱབ་པར་བྱེད་པ་
en: They embrace all wandering beings throughout space with the realm of phenomena.

source: དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀུན་ནས་ཁེབས་པར་བྱས་ཤིང་ངན་སོང་དང་མི་ཁོམ་པ་ལ་སོགས་པ་ནས་སེམས་ཅན་རྣམས་རྣམ་པར་བསླང་སྟེ། རྣམ་པ་ཐམས་ཅད་དུ་མཚན་དང་། དཔེ་བྱད་བཟང་པོ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་སྣང་བར་རྣམ་པར་དག་པ་ཡང་བྱིན་གྱིས་བརླབས་ཏེ།
en: In that way they cover all worlds, delivering sentient beings from the lower realms and the unfree states while continuously blessing them in many ways within the pure appearances of excellent marks, signs, and a circle of light.

source: བཀོད་པ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཀྱང་བྱིན་གྱིས་བརླབས་ནས། ལྷ་དང་མི་དགའ་བ་དང་མགུ་བ་དང་རངས་པ་མཆོག་ཏུ་གྱུར་པ།
en: Blessing all the worlds to be adorned with ornamental arrays, they bring supreme joy, contentment, and appreciation to gods and humans.

source: དགའ་བ་དང་བདེ་བ་མཆོག་ཐོབ་པ་དང་ལྡན་པ་རྣམས་ཀྱི་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་དཀར་པོའི་ལོ་ཏོག་དང་། རྩི་ཆེན་པོ་དང་། སྡོང་པོ་ཐམས་ཅད་རྣམ་པར་བསྐྱེད་པ་དང་།
en: They produce the crops, greenery, and trees of both mundane and supramundane qualities of virtue, which bring perfect happiness and bliss.

source: ཐམས་ཅད་དུ་སྐྱིད་པར་ཆོས་ཀྱི་དབང་བསྐུར་བའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུན་སུམ་ཚོགས་པ་དང་། དགའ་བར་བྱེད་པ་དང་།
en: Bringing all beings joy in this comprehensive manner, they empower them with the Dharma in order to bring them further perfect circumstances and joy.

source: རྒུད་པ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་ཀྱི་ཆར་ཆེན་པོ་མངོན་པར་འབེབས་ཏེ།
en: Then, causing a downpour of Dharma, they put an end to all decay.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཆར་སྤྲིན་ཆེན་པོ་ཀུན་ནས་སྐྱེད་པ་ཡིན་ནོ།
en: Thus, noble son, the bodhisattvas produce the great rainclouds of Dharma.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas pacify wandering beings’ torments of affliction.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་དྲི་ཞིམ་པོའི་ཆར་གྱི་རྒྱུན་གྱི་སྙིང་པོ་ཅན་ལྡང་ན། སེམས་ཅན་རྣམས་ཀྱི་གདུང་བ་ཡོངས་སུ་ཞི་བར་བྱས་ཤིང་། ལུས་ཤིན་ཏུ་སིམ་པ་དང་། བསིལ་བར་བྱེད་དོ།
en: Consider, noble son, how the wind carries a sweetly fragrant rain that pacifies the torments of sentient beings by soothing and cooling their bodies.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ངན་འགྲོ་དང་། ངན་པར་ལྟ་བ་དང་། ཉེས་བྱས་དང་། ཐེ་ཙོམ་དང་། ཕོངས་པ་མི་བཟད་པ་དང་། ཡུལ་ལ་སྲེད་པ་དང་། སྡུག་པ་དང་། མི་སྡུག་པ་དང་བྲལ་ཞིང་ཕྲད་པ་དང་། ནད་རྣམས་བཅིལ་ནས་
en: Similarly, for sentient beings, the wind-like bodhisattvas expel the torments of desire, anger, dullness, inferior realms, inferior views, misdeeds, doubt, poverty, negativity, craving for things, separation from the delightful, contact with the repulsive, and disease.

source: དམ་པ་མ་ཡིན་པའི་ཆོས་ལ་སྲེད་པ་ལ་སོགས་པའི་གདུང་བ་དག་
en: pacify all craving for ignoble qualities, and so forth.

source: དམ་པའི་ཆོས་ཀྱི་ཆར་དང་འདྲེས་པའི་བླ་ན་མེད་པའི་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་། སྨོན་ལམ་དང་། མཐོང་བ་དང་། རེག་པ་དང་། འགྲོགས་པ་དང་། བསྟན་པ་དོན་ཡོད་པ་ལ་སོགས་པས་རབ་ཏུ་ཞི་བར་བྱེད་དེ།
en: They pacify all those torments by means of unsurpassable pure discipline, along with unsurpassable aspiration, perception, contact, company, meaningful teaching, and so forth, that is all blended with the rain of the sacred Dharma.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་ཅིང་ཉོན་མོངས་པ་མེད་པའི་ས་ལ་འགོད་པ་ཡིན་ནོ།
en: Thus, noble son, bodhisattvas pacify wandering beings’ torments of affliction and establish them on the level beyond affliction.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་དཀར་པོ་ལས་འཐུན་པར་བྱུང་བའི་དབུགས་འབྱུང་བ་དང་། རྔུབ་པའི་སྲོག་ཉེ་བར་སྦྱོར་བ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder how bodhisattvas sustain sentient beings with vital breaths of air that emerge from their virtuous qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དབུགས་འབྱུང་བ་དང་། རྔུབ་པའི་རླུང་གི་མཐུས་སེམས་ཅན་ཐམས་ཅད་འཚོའོ།
en: Consider, noble son, how the force of the breath keeps beings alive.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་བསྒྲུབས་པ་དང་། བྱང་ཆུབ་སེམས་དཔས་བསྟབས་པའི་ཆོས་དཀར་པོའི་རླུང་མར་ཉེ་བར་སྤྱད་པ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་སྐྱེད་པས་ཀྱང་
en: Similarly, bodhisattvas use the wind of those virtuous qualities that they have accomplished and grant to others to bring forth all types of perfect sustenance.

source: སེམས་ཅན་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ།
en: In this way they delight all beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་
en: “Consider further, noble son, the analogy of the wind.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འདི་ལྟ་སྟེ། རྡོ་རྗེའི་དཀྱིལ་འཁོར་རྣམས་དང་། ཁོར་ཡུག་རི་དག་དང་། ཁོར་ཡུག་གི་རི་ཆེན་པོ་རྣམས་དང་། གླིང་ཆེན་པོ་བཞི་ཡོངས་སུ་འཛིན་པའི་གསེར་གྱི་དཀྱིལ་འཁོར་རྣམས་དང་།
en: In all world systems the wind produces the vajra circle and the golden circle that hold the surrounding mountains, great mountain ranges, and the four continents.

source: རྒྱ་མཚོ་རིན་པོ་ཆེའི་འབྱུང་གནས་དང་བཅས་པ་རྣམས་དང་།
en: It establishes the oceans that are the sources of jewels.

source: རི་རབ་དང་། རི་རབ་ཆེན་པོ་དང་། དེ་མ་ཡིན་པའི་རིན་པོ་ཆེའི་རི་དང་། གངས་དང་། རི་སྤོས་ཀྱི་ངད་ལྡང་བ་དང་། གྲོང་རྡལ་དང་། ནགས་ཚལ་དང་། གཞལ་མེད་ཁང་དག་དང་། འཛམ་བུའི་གླིང་དག་དང་། གླིང་ཆེན་པོ་བཞི་དག་དང་། སྟོང་དག་དང་། སྟོང་གཉིས་པ་དག་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་དག་བཀོད་པ་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་མངོན་པར་སྒྲུབ་བོ།
en: It establishes Mount Meru and Mount Mahāmeru, along with the jewel mountains, the snow mountains, the fragrant mountains, the towns, the forests, the palaces, Jambu­dvīpa, the four continents, the thousandfold universe, the millionfold universe, and the trichiliocosm with all its diverse arrays.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་ཕྱོགས་བཅུ་ཀུན་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཕུན་སུམ་ཚོགས་པ་ཉེ་བར་སྒྲུབ་བོ། །སྐྱེད་དོ། །ཡོངས་སུ་གཞོག་གོ།
en: Similarly, the wind-like bodhisattvas produce, bring forth, and establish all the heaps of virtue of sentient beings that have been accomplished throughout the ten directions.

source: དེ་ལ་ཇི་ལྟར་གངས་ཀྱི་རི་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟར་ནི་འཇིག་རྟེན་པའི་བསོད་ནམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་བལྟའོ།
en: The completion of the mountains can be likened to worldly merit.

source: ཇི་ལྟར་གླིང་ཆེན་པོ་བཞི་དང་རི་རབ་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟར་ནི་ཉན་ཐོས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་རྣམས་བལྟའོ།
en: The completion of the four great continents and Mount Meru can be likened to the perfections of the hearers.

source: ཇི་ལྟར་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟར་ནི་རང་སངས་རྒྱས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་རྣམས་བལྟའོ།
en: The completion of the thousandfold universe can be compared to the perfections of the solitary buddhas.

source: ཇི་ལྟར་སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟར་ནིི་བྱང་ཆུབ་སེམས་དཔའི་ཕུན་སུམ་ཚོགས་པ་རྣམས་བལྟའོ།
en: The completion of the millionfold universe can be aligned with the perfections of the bodhisattvas.

source: ཇི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟར་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་གཏུགས་པ།
en: The completion of the trichiliocosm can be likened to that which is superior to the entire world yet extends throughout space containing all world realms.

source: ཤིན་ཏུ་རྣམ་པར་དག་པར་གྲགས་པ་མཆོད་པ་ལ་དམིགས་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་གནས་པ་རྣམས་ཀྱིས་ཐམས་ཅད་མངོན་དུ་བྱས་ཏེ།
en: It is famed for its utter purity and manifested by those who are intent on worship.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་བསོད་ནམས་བརྒྱ་པའི་མཚན་དང་ལྡན་པ་རྟག་ཏུ་མཉམ་པར་བཞག་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་བལྟའོ།
en: It can be likened to the completion of a thus-gone one’s body endowed with the marks of a hundred merits and in constant equipoise.

source: དེ་ལ་རྒྱ་མཚོ་ལྟར་ནི་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོ་རྣམས་བལྟའོ།
en: The oceans can be compared to the oceans of absorption.

source: གླིང་དང་། བར་གྱི་གླིང་དང་། རི་གཞན་དང་། གླིང་ཆེན་པོ་བཞི་པ་ལ་སོགས་པ་ལྟར་ནི་སྦྱོར་བ་དང་། གཟུངས་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སློབ་མའི་དགེ་འདུན་ལ་སོགས་པ་བལྟའོ།
en: The islands, subcontinents, mountains, the four continents, and so forth can be compared to the various practices, retentions, maturations of sentient beings, saṅghas of disciples, and so forth.

source: གྲོང་རྡལ་དང་། ནགས་ཚལ་དང་། གཞལ་མེད་ཁང་ལྟར་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཡོན་ཏན་བཀོད་པ་རྣམས་བལྟའོ།
en: The towns, forests, and palaces can be compared to the perfectly pure qualities that abound in the buddha realms.

source: དཔག་བསམ་གྱི་ཤིང་གི་ནགས་ཚལ་ལྟར་ནི་ས་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། མངོན་པར་ཤེས་པ་དང་། རིག་པ་དང་། ཡེ་ཤེས་སྣང་བ་དང་། དབང་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་སོགས་པ་དབང་སྒྱུར་བ་དམ་པ་ཕུན་སུམ་ཚོགས་པའི་ཆོས་རྣམས་བལྟའོ།
en: The forests of wish-fulfilling trees can be compared to all the perfect qualities of true mastery. Thus they can be compared to the grounds, transcendences, absorptions, retentions, superknowledges, magical abilities, wisdom appearances, masteries, and powers of the bodhisattvas and the perfect buddhas, as well as to their fearlessnesses, unique qualities, and great compassion.

source: རིགས་ཀྱི་བུ་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསོད་ནམས་བརྒྱ་བའི་མཚན་གང་ཞེ་ན།
en: “Noble son, you may wonder what a blessed buddha’s marks of enormous merit are like.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གྲངས་མེད་པའི་བྱེ་མ་སྙེད་དག་ན་སེམས་ཅན་གང་ཇི་སྙེད་ཡོད་པ་
en: Noble son, think of all the sentient beings living in the countless worlds, as many as there are grains of sand in the river Gaṅgā, in each of the ten directions.

source: དེ་དག་ཐམས་ཅད་སྟོང་གསུམ་ཕྲག་བཅུའི་འཁོར་ལོས་སྒྱུར་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་གྱུར་ལ།
en: Then imagine that each of those beings has become endowed with the merit that is the possession of the universal emperors who rule in ten trichiliocosms.

source: དེ་ལྟ་བུའི་འཁོར་ལོས་སྒྱུར་བའི་དངོས་པོ་ཉིད་དང་ལྡན་པའི་སེམས་ཅན་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ཙམ་པ་དེ་བསྡོམས་པ་དང་། འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོ་གཅིག་ཅིག་ལྡན་པར་གྱུར་ཏེ།
en: Now imagine that the combined merit of all those beings who are thus universal emperors becomes the possession of each one of them individually, so that they all become great universal emperors.

source: རྣམ་གྲངས་དེས་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འདས་ཏེ། དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་སྙེད་ཅིག་འཁོར་ལོས་སྒྱུར་བའི་དངོས་པོ་དེ་འདྲ་བ་ཉིད་དང་སོ་སོར་ལྡན་པར་གྱུར་ལ།
en: In this way, just as you imagined that the nature of every single being in the worlds located in the east is that of universal emperors,

source: སྔ་མ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ནམ་མཁའི་མཐས་གཏུགས་པ་དག་ན་སེམས་ཅན་ཡོད་དོ་ཅོག་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་འཁོར་ལོས་སྒྱུར་བའི་དངོས་པོ་དེ་ལྟ་བུ་ཤ་སྟག་དང་སོ་སོར་ལྡན་པར་གྱུར་ཏེ།
en: next imagine that this is also the case with the beings who are present in all the worlds in the ten directions, as far as space extends.

source: དེ་བཞིན་དུ་བགྲང་བ་དེ་ཉིད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྙེད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་བརྒྱ་བྱིན་གྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པའི་བརྒྱ་བྱིན་ཤ་སྟག་ཏུ་གྱུར་ལ།
en: Then further think that each of those beings in all those worlds now comes to possess the heaps of merit that are the possession of Śakra, and that thus they now all becomes Śakras without exception.

source: ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གྲངས་མེད་པའི་བྱེ་མ་སྙེད་དུ་གཏོགས་པའི་བརྒྱ་བྱིན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ཙམ་པ་དེ་དང་བརྒྱ་བྱིན་གཅིག་ཅིག་ལྡན་པར་གྱུར་ཏེ།
en: Imagine then that the combined merit of all those Śakras—present across world realms as innumerable as the grains of sand in the river Gaṅgā throughout each of the ten directions

source: དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་ན་སེམས་ཅན་གང་ཇི་སྙེད་འཁོད་པ་དེ་དག་ཐམས་ཅད་བརྒྱ་བྱིན་དེ་དང་འདྲ་བ་ཤ་སྟག་ཏུ་གྱུར་ལ།
en: —becomes the individual endowment of each one of them, and that thus throughout all universes, as far as the realm of phenomena extends, all beings have become Śakras in possession of that sort of merit.

source: བགྲང་བ་དེ་ཉིད་ཀྱིས་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གྲངས་མེད་པའི་བྱེ་མ་སྙེད་དུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཚངས་པ་ཆེན་པོར་གྱུར་ལ།
en: Imagine further that all those beings who are present throughout universes as numerous as the grains of sand in the river Gaṅgā within each of the ten directions turn into Mahā­brahmās.

source: བསོད་ནམས་དེ་ཐམས་ཅད་གཅིག་ཏུ་བསྡོམས་པ་དང་ཚངས་པ་ཆེན་པོ་གཅིག་ཅིག་ལྡན་པར་གྱུར་ལ། ཚངས་པ་ཆེན་པོ་ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་བཞིན་དུ་གྱུར་ཏེ།
en: Then think that each of those Mahā­brahmās possesses the combined merit of them all, so that all of them become Mahā­brahmās with that sort of merit.

source: སྔ་མ་བཞིན་དུ་བགྲང་བ་དེ་ཉིད་ཀྱིས་ཉན་ཐོས་དག་དང་། རང་སངས་རྒྱས་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་ཆེན་པོ་ཐོབ་པ། འོད་ཟེར་གྱི་སྤྲིན་ཆེན་པོའི་དབང་བསྐུར་བས་དབང་བསྐུར་བ། དབང་བཅུ་ཐོབ་པ་ཤ་སྟག་ཏུ་གྱུར་ཏེ།
en: Then continue by imagining that those beings all progressively become hearers, solitary buddhas, and bodhisattvas who have attained the great grounds, become empowered by the great cloud of light rays, and attained the ten masteries.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་དེ་ལྟ་བུའི་སེམས་ཅན་ཐམས་ཅད་ཕྱོགས་བཅུ་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། ནམ་མཁའི་དབྱིངས་སུ་གཏོགས་པའི་དུས་གསུམ་པ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ཙམ་པ་དེ་དུས་གསུམ་གྱི་ནམ་མཁའི་དབྱིངས་སུ་གཏོགས་པ་དང་།
en: Then, noble son, if the combined heaps of merit of all those beings, present in this way throughout infinite universes in the ten directions and extending as far as space throughout the three times,

source: འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་བརྒྱར་བསྒྱུར་བས།
en: were to be multiplied by one hundred times the total number of particles that constitute all the worlds throughout space and time,

source: དེ་བཞིན་གཤེགས་པའི་བ་སྤུའི་ཁུང་བུ་གཅིག་མངོན་པར་འགྲུབ་བོ།
en: then that merit would be sufficient for producing a single hair follicle on the body of a thus-gone one.

source: བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་དུ་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་བཅུར་བསྒྱུར་བས།
en: “If the heaps of merit that bring forth all the hair follicles were multiplied by a million innumerably many times,

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལས་དཔེ་བྱད་བཟང་པོ་རེ་རེ་མངོན་པར་འགྲུབ་བོ།
en: the ensuing merit would suffice for the manifestation of one among the eighty excellent signs.

source: དཔེ་བྱད་བཟང་པོར་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཐམས་ཅད་བརྗོད་དུ་མེད་པ་བཅུར་བསྒྱུར་བས།
en: If the entire heap of merit required for the excellent signs were multiplied by ten innumerably many times,

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཉི་ཤུ་རྩ་དགུ་ལས་མཚན་རེ་རེ་མངོན་པར་འགྲུབ་བོ།
en: the merit that would ensue could bring forth one among the first twenty-nine marks of a thus-gone one.

source: དེ་ཡང་བརྗོད་དུ་མེད་པ་བཅུར་བསྒྱུར་བས་དེ་བཞིན་གཤེགས་པའི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ཟླ་བ་ཉ་སྟེ་དྲི་མ་མེད་པའི་དཀྱིལ་འཁོར་སྟོང་བས་ཀྱང་ལྷག་པར་མཛེས་པའི་འོད་དང་ལྡན་པ་མངོན་པར་འགྲུབ་བོ།
en: If, in turn, that merit were multiplied by ten inexpressibly many times then that would be enough to manifest the hair between the eyebrows, which is more radiant and delightful than a thousand stainless full moons.

source: དེ་ཡང་བརྗོད་དུ་མེད་པ་བྱེ་བ་སྟོང་ཕྲག་བཅུར་བསྒྱུར་བས་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་ཤིང་བལྟར་མི་སྣང་བ་གཙུག་ཏོར་གྱིས་ཡོངས་སུ་བརྒྱན་པ་མངོན་པར་འགྲུབ་བོ།
en: If, beyond that, such merit were multiplied by a quadrillion inexpressibly many times, it would yield the crown of a thus-gone one’s head which, being raised above all other beings, cannot be seen, and is adorned with the uṣṇīṣa.

source: དེ་ཡང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུར་བསྒྱུར་བས་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་གསུང་ཡན་ལག་སྟོང་ཕྲག་དྲུག་ཅུ་པ་
en: Finally, if that merit were multiplied by inexpressibly many hexillions of inexpressibly many times, then that would bring forth the voice of a thus-gone buddha, endowed with sixty thousand aspects.

source: དམིགས་པ་ཐམས་ཅད་ལས་གསུང་གི་སྒྲ་མཐའ་ཡས་པར་འབྱུང་བ་ལྷུན་གྱིས་གྲུབ་པས་སེམས་ཅན་ཐམས་ཅད་བསམ་པ་ཡོངས་སུ་སིམ་པར་གྱུར་ལ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གོ་བར་བྱེད་པ་མངོན་པར་འགྲུབ་སྟེ།
en: Since this spontaneously manifests as infinite statements in accord with all perspectives, it satisfies all beings and is understood throughout all realms of the world.

source: རིགས་ཀྱི་བུ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསོད་ནམས་བརྒྱ་པའི་མཚན་ཅེས་བྱའོ།
en: Noble son, this is what is understood by a blessed buddha’s marks of enormous merit.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་མི་ཟད་པ་དང་ལྡན་ཞིང་ཀུན་ཏུ་རྒྱས་པར་བྱེད་པ་བཀོད་པ་དང་ལྡན་པས་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Noble son, in this way the thus-gone ones sustain all beings through their inexhaustible accumulations of merit and wisdom, and due to their vast displays.

source: རིགས་ཀྱི་བུ་ཡོངས་སུ་བརྟག་པ་བཟུང་ན། གལ་ཏེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་གཏུགས་པ་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ས་བཅུ་པ་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པ།
en: “Noble son, imagine that all the beings in all the universes throughout the ten directions, as infinite as the realm of phenomena and present as far as space, had reached the tenth ground of the Cloud of Dharma.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་རྒྱན་འཆང་བ། དབང་བཅུ་ལ་དབང་སྒྱུར་བ་ཤ་སྟག་ཏུ་གྱུར་ཏེ།
en: All of them would then possess the supreme ornaments of body, speech, and mind and would have accomplished the ten masteries.

source: དེ་བཞིན་གཤེགས་པའི་བ་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་
en: Imagine if they all came to venerate the merit associated with just one hair follicle of the Thus-Gone One,

source: འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་སྣོད་རིན་པོ་ཆེ་སྣ་ཚོགས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ནམ་མཁའི་ཚད་ཙམ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སོ་སོ་ནས་ཐོགས་ཏེ།
en: carrying as many vessels made of gold from the river Jāmbū, and adorned with all sorts of jewels, as there are grains of sand in the river Gaṅgā and extending to the end of space.

source: ཕྱི་མའི་མཐར་ཐུག་པའི་བསྐལ་པར་ཡོངས་སུ་བཀང་ཞིང་སྐད་ཅིག་སྐད་ཅིག་ཏུ་བླངས་ཤིང་ཁྱེར་ཡང་བ་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་གང་བའམ་འབྲི་བར་མི་མངོན་ཏེ།
en: Even if they were to bring such offerings continuously until the final eon, it would neither eclipse nor exceed the merit that is associated with that single hair follicle.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་བརྒྱའི་མཚན་ནི་
en: Noble son, such are a thus-gone one’s marks of enormous merit.

source: དེ་ལ་ས་བཅུ་གཉིས་གང་ཞེ་ན།
en: “What, you may wonder, are the twelve grounds?
